---
title: MEPNetworkSegmentData
classe: Autodesk.Revit.DB.Analysis.MEPNetworkSegmentData
namespace: Autodesk.Revit.DB.Analysis
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 16
---

# MEPNetworkSegmentData

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Double Coefficient { get; }` | `mEPNetworkSegmentData.Coefficient` | Double |
| `Double Flow { get; }` | `mEPNetworkSegmentData.Flow` | Double |
| `PipeFlowState FlowState { get; }` | `mEPNetworkSegmentData.FlowState` | PipeFlowState |
| `Double FrictionFactor { get; }` | `mEPNetworkSegmentData.FrictionFactor` | Double |
| `Boolean IsCriticalPath { get; }` | `mEPNetworkSegmentData.IsCriticalPath` | Boolean |
| `Boolean IsValidObject { get; }` | `mEPNetworkSegmentData.IsValidObject` | Boolean |
| `Double PressureDrop { get; }` | `mEPNetworkSegmentData.PressureDrop` | Double |
| `Double RelativeRoughness { get; }` | `mEPNetworkSegmentData.RelativeRoughness` | Double |
| `Double ReynoldsNumber { get; }` | `mEPNetworkSegmentData.ReynoldsNumber` | Double |
| `Int32 SectionNumber { get; }` | `mEPNetworkSegmentData.SectionNumber` | Int32 |
| `Double Velocity { get; }` | `mEPNetworkSegmentData.Velocity` | Double |
| `Double VelocityPressure { get; }` | `mEPNetworkSegmentData.VelocityPressure` | Double |
| `Void Dispose()` | `mEPNetworkSegmentData.Dispose()` | Void |
| `IList<MEPNetworkSegmentId> GetDownstreamSegments()` | `mEPNetworkSegmentData.GetDownstreamSegments()` | IList<MEPNetworkSegmentId> |
| `IList<MEPNetworkSegmentId> GetUpstreamSegments()` | `mEPNetworkSegmentData.GetUpstreamSegments()` | IList<MEPNetworkSegmentId> |
| `Boolean IsValid()` | `mEPNetworkSegmentData.IsValid()` | Boolean |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```